{
    "_type": "news",
    "didUMean": "",
    "totalCount": 26,
    "relatedSearch": [],
    "value": [
        {
            "id": "8947774041927135852",
            "title": "Biden: Putin should face war crimes trial for Bucha killings",
            "url": "-putin-should-face-war-crimes-trial-for-bucha/2022/04/04/6d4b1f56-b425-11ec-8358-20aa16355fb4_story.html",
            "description": "President Joe Biden called for war crimes trial against Russian President Vladimir Putin and said hed seek more sanctions after reported atrocities in Ukraine",
            "body": "ArrowRight\nBidens comments to reporters came after Ukraine President Volodymyr Zelenskyy visited Bucha, one of the towns surrounding Kyiv where Ukrainian officials say the bodies of civilians have been found. Zelenskyy called the Russian actions genocide and called for the West to apply tougher sanctions against Russia.\nBiden, however, stopped short of calling the actions genocide.\nThe bodies of 410 civilians have been removed from Kyiv-area towns that were recently retaken from Russian forces, Ukraines prosecutor-general, Iryna Venediktova, said. Associated Press journalists saw the bodies of at least 21 people in various spots around Bucha, northwest of the capital.\nAdvertisement\nStory continues below advertisement\nWe have to continue to provide Ukraine with the weapons they need to continue the fight. And we have to gather all the detail so this can be an actual -- have a war crimes trial, Biden said.\nBiden lashed out at Putin as brutal.\nWhats happening in Bucha is outrageous and everyone sees it, Biden added.\nEuropean Commission President Ursula von der Leyen, the European Commission president, tweeted Monday that he European Union will send investigators to Ukraine to help the local prosecutor general document war crimes.\nComment",
            "snippet": "President Joe Biden called for war crimes trial against Russian President Vladimir Putin and said hed seek more sanctions after reported atrocities in Ukraine.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2022-04-04T14:42:18",
            "provider": {
                "name": "washingtonpost",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "-apps/imrs.php?src=-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3Z56BFFUEQI6ZA2YECVBMNK7WQ.jpg&w=1200",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "washingtonpost",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "-putin-should-face-war-crimes-trial-for-bucha/2022/04/04/6d4b1f56-b425-11ec-8358-20aa16355fb4_story.html"
            }
        }
    ]
}