{
    "_type": "news",
    "didUMean": "",
    "totalCount": 25,
    "relatedSearch": [],
    "value": [
        {
            "id": "9157155854769533678",
            "title": "Russia starts own inquiry into Ukraine deaths",
            "url": "-updates-britain-slates-russia-for-barbaric-killings/",
            "description": "The latest information on the war on April 4, 2022. Read more on Boston.com.",
            "body": "Email\nA Russian law enforcement agency says it has launched its own investigation into allegations that Ukrainian civilians were massacred in suburbs of Kyiv which were held by Russian troops, focusing on what it calls false information about Russian forces.\nThe Investigative Committee claims Ukrainian authorities made the allegations with the aim of discrediting Russian troops and that those involved should be investigated over possible breaches of a new Russian law banning what the government deems to be false information about its forces.\nRussian law enforcement has launched several investigations since Russian troops entered Ukraine, typically into incidents such as the shelling of areas held by Russia-backed separatists.\nAdvertisement:\nKEY DEVELOPMENTS IN THE RUSSIA-UKRAINE WAR:\n Russia faces growing outrage amid new evidence of atrocities\n Ukraine accuses Russia of massacre, city strewn with bodies\n Fill the silence with your music, Zelenskyy tells Grammys\n Drug shortages persist in Russia after start of Ukraine war\n  Ukrainian refugees find jobs, kindness as they settle in\n Go to -ukraine for more coverage\n___\nOTHER DEVELOPMENTS:\nKYIV, Ukraine  Ukrainian President Volodymyr Zelenskyy says that Russia needs to move quickly to negotiate an agreement to end the war.\nSpeaking on a visit Monday to the town of Bucha outside Kyiv, where hundreds of civilians were found dead after Russian troops retreat last week, Zelenskyy said the evidence of atrocities makes it hard to conduct talks with Russia.\nIts very difficult to conduct negotiations when you see what they did here, Zelenskyy said, adding that in Bucha and other places dead people have been found in barrels, basements, strangled, tortured. He added that the Russian leadership needs to think faster if it has what to think with.\nZelenskyy added that the longer the Russian Federation drags it out, the worse it will exacerbate its own situation and this war. Zelenskyy reaffirmed his criticism of former German Chancellor Angela Merkels opposition to Ukraines bid to join NATO, saying that she and other Western leaders who resisted the move should come to Bucha to see what the flirting with the Russian Federation leads to.\nAdvertisement:\n___\nCAIRO  Five Arab foreign ministers have traveled to Moscow for talks with Russias top diplomat on the war in Ukraine.\nThe Arab League says the foreign ministers of Egypt, Algeria, Iraq, Jordan and Sudan will meet Monday with Russian Foreign Minister Sergey Lavrov. Ahemd Aboul Gheit, Secretary-General of the Arab League, will also join the meeting.\nThe pan-Arab organization says the ministers will then travel to Poland on Tuesday for talks with Ukraines Foreign Minister Dmytro Kuleba.\n___\nGENEVA  The United States plans to seek a suspension of Russia from its seat on the U.N.s top human rights body in the wake of rising signs that Russian forces may have committed war crimes in Ukraine, U.S. Ambassador to the United Nations Linda Thomas-Greenfield said Monday.\nAccording to a statement from her office, Thomas-Greenfield made the call for Russia to be stripped of its seat in the Human Rights Council in the wake of reports over the weekend about violence against civilians in the town of Bucha, near the Ukrainian capital Kyiv, after Russian forces pulled out.\nAny decision to suspend Russia would require a decision by the U.N. General Assembly in New York.\nRussia and the other four permanent members of the U.N. Security Council  Britain, China, France and the United States  all currently have seats on the 47-member rights council, which is based in Geneva. The United States rejoined the council this year.\nAdvertisement:\nThomas-Greenfield mentioned the U.S. plan in a meeting with Romanian Prime Minister Nicolae Ciuca, her office said.\nIn New York, General Assembly spokeswoman Paulina Kubiak said on Monday that no request for a meeting on the issue has been received yet.\n___\nGENEVA  The United Nations top human rights official is calling for independent and effective investigations into what happened in the Ukrainian town of Bucha.\nU.N. High Commissioner for Human Rights Michelle Bachelet said in a statement Monday that she is horrified by the images of civilians lying dead on the streets and in improvised graves.\nShe added that reports emerging from this and other areas raise serious and disturbing questions about possible war crimes, grave breaches of international humanitarian law and serious violations of international human rights law.\nBachelet said its essential that all bodies be exhumed and identified so that victims families can be informed and the exact causes of death determined. She said all measures should be taken to preserve evidence.\nIt is vital that all efforts are made to ensure there are independent and effective investigations into what happened in Bucha to ensure truth, justice and accountability, as well as reparations and remedy for victims and their families, Bachelet said.\n___\nLONDON  Britain has condemned Russias barbaric killing of civilians in Ukraine, though it stopped short of calling Moscows actions genocide.\nPrime Minister Boris Johnsons spokesman, Max Blain, said bodies found in areas recently recaptured from Russia showed despicable attacks against innocent civilians, and they are yet more evidence that Putin and his army are committing what appear to be war crimes in Ukraine.\nAdvertisement:\nUkraines President Volodymyr Zelenskyy and some Western leaders have accused Russia of committing genocide.\nBlain said the prime ministers view is that Putin crossed the threshold of barbarism some time ago, but added that only a court can make a determination of genocide.\nBritain is urging Western allies to enforce tougher sanctions to ratchet up pressure on Russia, including cutting it off completely from the SWIFT international payments system.\n___\nMOSCOW  Russian President Vladimir Putin has congratulated the Moscow-friendly leaders of Hungary and Serbia on winning elections.\nIn a letter sent Monday to Hungarys nationalist Prime Minister Viktor Orban whose right-wing Fidesz party won a landslide victory in Sundays vote, Putin said that despite the difficult international situation, the further development of bilateral partnership fully conforms to the interests of peoples of Russia and Hungary, according to the Kremlin.\nPutin also congratulated Serbian President Aleksandar Vucic on his re-election Sunday, saying that the outcome of the vote confirms a broad public support for his independent foreign policies. The Russian leader voiced hope that Vucics activities will help further strengthen the strategic partnership between Russia and Serbia.\n___\nMOSCOW  Russias top diplomat has dismissed Ukraines accusations that Russian troops committed atrocities against its civilians as a staged provocation.\nRussian Foreign Minister Sergey Lavrov said at the start of his talks Monday with U.N. Under-Secretary-General Martin ",
            "snippet": "The latest information on the war on April 4, 2022.\nRead more on Boston.com.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2022-04-04T12:29:26",
            "provider": {
                "name": "boston",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "-content/uploads/2022/04/c3c4f3be-9ca4-4b00-adcd-d38702317d8f-624a3c4db6062-scaled.jpg",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "boston",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "-updates-britain-slates-russia-for-barbaric-killings/"
            }
        }
    ]
}