{
    "_type": "news",
    "didUMean": "",
    "totalCount": 20,
    "relatedSearch": [],
    "value": [
        {
            "id": "582037788625982283",
            "title": "Watch: Bucha mayor describes indiscriminate killings of civilians by Russian forces",
            "url": "-ukraine/2022/04/04/bucha-mayor-describes-russian-attacks-civilians/",
            "description": "The mayor of Bucha, Ukraine, appeared on CNN on Monday to describe the destruction wrought on his city. Read more on Boston.com.",
            "body": "Global outrage follows allegations that Russia executed civilians\nAnatoly Fedoruk told host Brianna Keilar through an interpreter that half of Bucha is destroyed and dead bodies are lying on the citys streets.\nThe New York Times reports a mass grave dug near an Orthodox church in the city has been filled with at least 40 bodies since the Russian occupation of the suburb began. Ukrainian officials say they have found bodies of 410 civilians in towns surrounding Kyiv, including Bucha, with some showing signs of torture or found with hands bound and shot at close range.\nAdvertisement:\nFedoruk said Ukrainian first responders are working to clear mines from streets and houses around the area and restore the citys basic infrastructure.\nWe are also working on identifying the bodies of the people who were shot dead in our city, Fedoruk said. They were indiscriminately killed by the Russian occupiers, a lot of them are elderly people. We get the impression that the Russian occupiers got the green light from Putin and  the Russian defense minister to have a safari in Ukraine. And they werent able to take Kyiv, so they vented their frustration on Bucha and the surrounding areas.\nThe work is ongoing to identify the bodies, which range in age from the elderly to children, in the street and mass grave, the mayor told CNN. Families who previously left Bucha are pleading for information as they try to locate loved ones, worried they may be among the dead or forcibly deported to Belarus, Fedoruk said.\nThe mayor told CNN the Russian people will never be forgiven for the atrocities that have occured in his city.\nThey posed no threat to the Russian troops or Russia as a whole, Fedoruk said. They posed absolutely no danger, and it was impossible not to see that they were children, not to see that a mother is carrying a child. And these cynical atrocities are what the Russian troops are all about, thats what Russia is all about. And we shall never forgive them. They shall never be forgiven on this earth or in heaven.\nAdvertisement:\nWatch his full account below:\nInformation from the Associated Press was used in this report.\nNewsletter Signup",
            "snippet": "The mayor of Bucha, Ukraine, appeared on CNN on Monday to describe the destruction wrought on his city.\nRead more on Boston.com.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2022-04-04T18:56:52",
            "provider": {
                "name": "boston",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "-content/uploads/2022/04/Russia_Ukraine_War_81745-624b21481fbdf-scaled.jpg",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "boston",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "-ukraine/2022/04/04/bucha-mayor-describes-russian-attacks-civilians/"
            }
        }
    ]
}